<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3e6a8ec279616f8c21aa523800c789413824c8b82998518fd093008ce660ab4c","plan_job_ref":"Job Terraform Plan #707 at https://github.com/cal-itp/data-infra/actions/runs/20087440615","plan_out_hash":"44b9ba9341bbb718fb936a4b113fc96c028dbbf422f769289a78e4208f7197c0","plan_hash":"e306ac07928530aa6b3a35a009d278a6687b3f77e9197b834ac3e9d51150bc8a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/enghouse-sftp/us__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_deployment.enghouse-sftp will be created
+   resource "kubernetes_deployment" "enghouse-sftp" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app" = "enghouse-sftp"
            }
+           name             = "enghouse-sftp-deployment"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "1"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app" = "enghouse-sftp"
                }
            }

+           strategy (known after apply)

+           template {
+               metadata {
+                   annotations      = {
+                       "gke-gcsfuse/volumes" = "true"
                    }
+                   generation       = (known after apply)
+                   labels           = {
+                       "app" = "enghouse-sftp"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }
+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   scheduler_name                   = (known after apply)
+                   service_account_name             = "sftp-pod-service-account"
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       command                    = [
+                           "/bin/sh",
+                           "-c",
+                           <<-EOT
                                apk update
                                            apk add openssl openssh openssh-server
                                            addgroup -g 2222 sftpusers
                                            adduser -u 2222 -S -G sftpusers -s /sbin/nologin -D -H enghouse
                                            echo 'enghouse:enghousesftpuserpassword' | chpasswd
                                
                                            mkdir -p /home/enghouse/.ssh
                                            cp /tmp/ssh-keys/authorized_keys /home/enghouse/.ssh/authorized_keys
                                            chmod 700 /home/enghouse/.ssh
                                            chmod 600 /home/enghouse/.ssh/authorized_keys
                                            chown -R enghouse:sftpusers /home/enghouse/.ssh
                                
                                            echo "HostKey /etc/ssh/hostkey/id_rsa" >> /etc/ssh/sshd_config
                                            echo "PasswordAuthentication no" >> /etc/ssh/sshd_config
                                            echo "PermitRootLogin no" >> /etc/ssh/sshd_config
                                            echo "X11Forwarding no" >> /etc/ssh/sshd_config
                                            echo "AllowTcpForwarding no" >> /etc/ssh/sshd_config
                                            echo "Match User enghouse" >> /etc/ssh/sshd_config
                                            echo "Subsystem sftp internal-sftp" >> /etc/ssh/sshd_config
                                            echo "ForceCommand internal-sftp" >> /etc/ssh/sshd_config
                                            echo "ChrootDirectory %h" >> /etc/ssh/sshd_config
                                            /usr/sbin/sshd -D -e
                            EOT,
                        ]
+                       image                      = "alpine"
+                       image_pull_policy          = (known after apply)
+                       name                       = "sftp-server"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       env {
+                           name  = "SFTP_USER"
+                           value = "enghouse"
                        }

+                       port {
+                           container_port = 22
+                           protocol       = "TCP"
                        }

+                       resources (known after apply)

+                       volume_mount {
+                           mount_path        = "/home/enghouse/data"
+                           mount_propagation = "None"
+                           name              = "gcs-volume"
+                           read_only         = false
                        }
+                       volume_mount {
+                           mount_path        = "/etc/ssh/hostkey"
+                           mount_propagation = "None"
+                           name              = "sftp-hostkeys"
+                           read_only         = true
                        }
+                       volume_mount {
+                           mount_path        = "/tmp/ssh-keys"
+                           mount_propagation = "None"
+                           name              = "sftp-authorizedkey"
+                           read_only         = true
                        }
                    }

+                   image_pull_secrets (known after apply)

+                   readiness_gate (known after apply)

+                   volume {
+                       name = "gcs-volume"

+                       csi {
+                           driver            = "gcsfuse.csi.storage.gke.io"
+                           volume_attributes = {
+                               "bucketName"   = "cal-itp-data-infra-staging-enghouse-raw"
+                               "mountOptions" = "uid=2222,gid=2222,file-mode=777,dir-mode=777"
                            }
                        }
                    }
+                   volume {
+                       name = "sftp-hostkeys"

+                       secret {
+                           default_mode = "0600"
+                           secret_name  = "enghouse-sftp-hostkeys"
                        }
                    }
+                   volume {
+                       name = "sftp-authorizedkey"

+                       secret {
+                           default_mode = "0600"
+                           secret_name  = "enghouse-sftp-authorizedkey"
                        }
                    }
                }
            }
        }
    }

  # kubernetes_secret.enghouse-sftp-authorizedkey will be created
+   resource "kubernetes_secret" "enghouse-sftp-authorizedkey" {
+       binary_data_wo                 = (write-only attribute)
+       data                           = (sensitive value)
+       data_wo                        = (write-only attribute)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "enghouse-sftp-authorizedkey"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.enghouse-sftp-hostkeys will be created
+   resource "kubernetes_secret" "enghouse-sftp-hostkeys" {
+       binary_data_wo                 = (write-only attribute)
+       data                           = (sensitive value)
+       data_wo                        = (write-only attribute)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "enghouse-sftp-hostkeys"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service.enghouse-sftp will be created
+   resource "kubernetes_service" "enghouse-sftp" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           name             = "enghouse-sftp"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           allocate_load_balancer_node_ports = true
+           cluster_ip                        = (known after apply)
+           cluster_ips                       = (known after apply)
+           external_traffic_policy           = (known after apply)
+           health_check_node_port            = (known after apply)
+           internal_traffic_policy           = (known after apply)
+           ip_families                       = (known after apply)
+           ip_family_policy                  = (known after apply)
+           load_balancer_ip                  = "35.236.24.31"
+           publish_not_ready_addresses       = false
+           selector                          = {
+               "app" = "enghouse-sftp"
            }
+           session_affinity                  = "None"
+           type                              = "LoadBalancer"

+           port {
+               node_port   = (known after apply)
+               port        = 22
+               protocol    = "TCP"
+               target_port = "22"
            }

+           session_affinity_config (known after apply)
        }
    }

  # kubernetes_service_account.sftp-pod-service-account will be created
+   resource "kubernetes_service_account" "sftp-pod-service-account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = {
+               "iam.gke.io/gcp-service-account" = "sftp-pod-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
            }
+           generation       = (known after apply)
+           name             = "sftp-pod-service-account"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  kubernetes_service_enghouse-sftp_load_balancer_status = [
-       {
-           load_balancer = [
-               {
-                   ingress = [
-                       {
-                           hostname = ""
-                           ip       = "35.236.24.31"
                        },
                    ]
                },
            ]
        },
    ] -> (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #707](https://github.com/cal-itp/data-infra/actions/runs/20087440615)